In [1]:
import json

# Assuming 'json_string_data' is a column with JSON strings
# df['json_string_data'] = df['json_string_data'].apply(json.loads)

In [2]:
# Re-import pandas after the code execution state was reset
import pandas as pd

# Generate a sample DataFrame with 4 rows of data, each cell containing a list of dictionaries
structured_data_list = [
    [{"name": "John", "age": 30, "city": "New York"},
     {"name": "Anna", "age": 22, "city": "Berlin"},
     {"name": "Mike", "age": 32, "city": "San Francisco"}],
    [{"name": "Sara", "age": 28, "city": "London"},
     {"name": "Alex", "age": 21, "city": "Moscow"},
     {"name": "Linda", "age": 35, "city": "Paris"}],
    [{"name": "Eva", "age": 29, "city": "Madrid"},
     {"name": "Sam", "age": 31, "city": "Rome"},
     {"name": "Lucy", "age": 26, "city": "Chicago"}],
    [{"name": "Tom", "age": 33, "city": "Miami"},
     {"name": "Jenny", "age": 25, "city": "Tokyo"},
     {"name": "Chris", "age": 34, "city": "Sydney"}]
]

# Create a DataFrame
df_structured = pd.DataFrame({'structured_data': structured_data_list})

df_structured

                                     structured_data
0  [{'name': 'John', 'age': 30, 'city': 'New York...
1  [{'name': 'Sara', 'age': 28, 'city': 'London'}...
2  [{'name': 'Eva', 'age': 29, 'city': 'Madrid'},...
3  [{'name': 'Tom', 'age': 33, 'city': 'Miami'}, ...

In [3]:
# Iterate over the DataFrame to evaluate each row of structured_data as a DataFrame

# This will store the resulting DataFrames in a list for demonstration
list_of_dfs = []

for index, row in df_structured.iterrows():
    # Convert each list of dictionaries to a DataFrame
    temp_df = pd.DataFrame(row['structured_data'])
    # Append the newly created DataFrame to the list
    list_of_dfs.append(temp_df)
    # For demonstration, print the DataFrame
    print(f"DataFrame from row {index}:\n{temp_df}\n")

# Now, 'list_of_dfs' contains all the DataFrames created from each row's structured_data
# Example: Access the first DataFrame created from the first row's structured_data
first_df = list_of_dfs[0]
first_df

DataFrame from row 0:
   name  age           city
0  John   30       New York
1  Anna   22         Berlin
2  Mike   32  San Francisco

DataFrame from row 1:
    name  age    city
0   Sara   28  London
1   Alex   21  Moscow
2  Linda   35   Paris

DataFrame from row 2:
   name  age     city
0   Eva   29   Madrid
1   Sam   31     Rome
2  Lucy   26  Chicago

DataFrame from row 3:
    name  age    city
0    Tom   33   Miami
1  Jenny   25   Tokyo
2  Chris   34  Sydney

   name  age           city
0  John   30       New York
1  Anna   22         Berlin
2  Mike   32  San Francisco

In [4]:
# Iterate over the list of DataFrames and perform operations
for i, df in enumerate(list_of_dfs):
    # Example operation: print the shape of each DataFrame
    print(f"DataFrame {i} shape: {df.shape}")
    # Perform other operations or analyses as needed
    # For instance, you can print the DataFrame to see its content
    print(df, "\n")

DataFrame 0 shape: (3, 3)
   name  age           city
0  John   30       New York
1  Anna   22         Berlin
2  Mike   32  San Francisco

DataFrame 1 shape: (3, 3)
    name  age    city
0   Sara   28  London
1   Alex   21  Moscow
2  Linda   35   Paris

DataFrame 2 shape: (3, 3)
   name  age     city
0   Eva   29   Madrid
1   Sam   31     Rome
2  Lucy   26  Chicago

DataFrame 3 shape: (3, 3)
    name  age    city
0    Tom   33   Miami
1  Jenny   25   Tokyo
2  Chris   34  Sydney